import { TermsOfServiceIcon } from "@/components/icons/TersmOfservise";

export default function TermsOfService() {
  return (
    <div className="container mx-auto w-[1100px]  w-full ">
      <div className="flex gap-3 py-5">
        <TermsOfServiceIcon />
        <h1 className="font-bold text-2xl">Үйлчилгээний нөхцөл</h1>
      </div>
      <p className="indent-8">
        Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
        ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
        худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
      </p>
      <p className="indent-4">
        {" "}
        Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ.
      </p>
      <p>
        Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага
        гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.
      </p>
      <p>
        Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
        ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
        худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
      </p>
      <p className="indent-4">
        {" "}
        Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ.
      </p>
      <p className="indent-10 mb-10">
        {" "}
        Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага
        гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.
      </p>
      <p>
        Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ.
      </p>
      <p className="indent-10 mb-10">
        Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага
        гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.
      </p>
      <p className="indent-8">
        Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
        ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
        худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
      </p>
      <p className="indent-4">
        {" "}
        Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ.
      </p>
      <p>
        Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага
        гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.
      </p>
      <p>
        Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
        ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
        худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
      </p>
      <p className="indent-4">
        {" "}
        Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ.
      </p>
      <p className="indent-10 mb-10">
        {" "}
        Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага
        гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.
      </p>
      <p>
        Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ.
      </p>
      <p className="indent-10 h-[100px]">
        Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага
        гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.
      </p>
    </div>
  );
}
